[![env0](https://app.env0.com/images/vcs-comment-banner.png)](https://env0.com)
🚀&nbsp; env0 had composed a PR Plan for environment [My First Project / Env0Test-86766 ](https://app.env0.com/p/6f72922f-596d-4fe8-a3d3-ee61bf6f7f54/environments/7a0204f9-a5c5-4666-8a90-cbaaf10e8b6f):
```
Plan: 3 to add, 0 to change, 3 to destroy.
```
<details>
<summary>Plan Details</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:


  # module.s3.aws_s3_bucket.this[0] must be replaced
-/+ resource "aws_s3_bucket" "this" {
+       acceleration_status         = (known after apply)
!       arn                         = "arn:aws:s3:::env0-acme-bucket-pqq8do" -> (known after apply)
!       bucket                      = "env0-acme-bucket-pqq8do" -> "env0-acme-bucket2-pqq8do" # forces replacement
!       bucket_domain_name          = "env0-acme-bucket-pqq8do.s3.amazonaws.com" -> (known after apply)
!       bucket_regional_domain_name = "env0-acme-bucket-pqq8do.s3.us-west-2.amazonaws.com" -> (known after apply)
!       hosted_zone_id              = "Z3BJ6K6RIION7M" -> (known after apply)
!       id                          = "env0-acme-bucket-pqq8do" -> (known after apply)
!       object_lock_enabled         = false -> (known after apply)
!       region                      = "us-west-2" -> (known after apply)
!       request_payer               = "BucketOwner" -> (known after apply)
-       tags                        = {} -> null
!       tags_all                    = {} -> (known after apply)
+       website_domain              = (known after apply)
+       website_endpoint            = (known after apply)
        # (2 unchanged attributes hidden)

-       server_side_encryption_configuration {
-           rule {
-               bucket_key_enabled = false -> null

-               apply_server_side_encryption_by_default {
-                   sse_algorithm = "AES256" -> null
                }
            }
        }

-       versioning {
-           enabled    = false -> null
-           mfa_delete = false -> null
        }
    }

  # module.s3.aws_s3_bucket_ownership_controls.this[0] must be replaced
-/+ resource "aws_s3_bucket_ownership_controls" "this" {
!       bucket = "env0-acme-bucket-pqq8do" # forces replacement -> (known after apply) # forces replacement
!       id     = "env0-acme-bucket-pqq8do" -> (known after apply)

        # (1 unchanged block hidden)
    }

  # module.s3.aws_s3_bucket_public_access_block.this[0] must be replaced
-/+ resource "aws_s3_bucket_public_access_block" "this" {
!       bucket                  = "env0-acme-bucket-pqq8do" # forces replacement -> (known after apply) # forces replacement
!       id                      = "env0-acme-bucket-pqq8do" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

Plan: 3 to add, 0 to change, 3 to destroy.

Changes to Outputs:
!   s3_bucket_arn = "arn:aws:s3:::env0-acme-bucket-pqq8do" -> (known after apply)
╷
│ Warning: Attribute Deprecated
│ 
│   with random_string.random,
│   on s3env0Bucket.tf line 29, in resource "random_string" "random":
│   29:   number  = true
│ 
│ **NOTE**: This is deprecated, use `numeric` instead.
│ 
│ (and one more similar warning elsewhere)
╵
```
</details>


```
Failed to calculate cost estimation
```


[Full PR Plan logs on env0](https://app.env0.com/p/6f72922f-596d-4fe8-a3d3-ee61bf6f7f54/environments/7a0204f9-a5c5-4666-8a90-cbaaf10e8b6f/deployments/388b7c8e-7ac4-48a9-b2a2-a75d4d651fb2)